[
    {
        "Filtering": {
            "Definitions": [
                "Focusing on the negative details while ignoring the positive aspects of a situation."
            ],
            "Examples": [
                "Ignoring positive comments on a social media post and fixating on a single negative remark."
            ]
        }
    },
    {
        "All-or-nothing thinking": {
            "Definitions": [
                "Seeing things in black-and-white categories. If a situation falls short of perfect, it's seen as a total failure."
            ],
            "Examples": [
                "Thinking you're a complete failure if your social media post doesn't receive a certain number of likes."
            ]
        }
    },
    {
        "Overgeneralization": {
            "Definitions": [
                "Making broad interpretations from a single or few events."
            ],
            "Examples": [
                "Assuming that you're universally disliked because a few people unfollowed you on social media."
            ]
        }
    },
    {
        "Jumping to conclusions": {
            "Definitions": [
                "Making negative interpretations without actual evidence. Two key forms are mind reading (assuming the thoughts and intentions of others) and fortune telling (predicting how things will turn out)."
            ],
            "Examples": [
                "Assuming a friend is mad at you because they haven't liked your recent social media posts.",
                "Believing that sharing your opinions on social media will lead to conflict and rejection."
            ]
        }
    },
    {
        "Magnification (Catastrophizing) or Minimization": {
            "Definitions": [
                "Blowing things out of proportion or inappropriately shrinking something to make it seem less important."
            ],
            "Examples": [
                "Thinking your life is ruined because you made a minor mistake in a post.",
                "Dismissing the significance of positive interactions online."
            ]
        }
    },
    {
        "Emotional Reasoning": {
            "Definitions": [
                "Believing that because you feel a certain way, what you think must be true."
            ],
            "Examples": [
                "Feeling embarrassed so you believe you must be an awkward person after an awkward social media interaction."
            ]
        }
    },
    {
        "Should Statements": {
            "Definitions": [
                "Using 'should', 'must', or 'ought' to make yourself feel guilty, or to set unrealistic expectations for others."
            ],
            "Examples": [
                "'I should always have engaging content', leading to stress and burnout.",
                "'People must like my posts', leading to disappointment when expectations are not met."
            ]
        }
    },
    {
        "Labeling and Mislabeling": {
            "Definitions": [
                "Assigning global negative labels to yourself or others based on specific behaviors in limited contexts."
            ],
            "Examples": [
                "Calling yourself 'a loser' for not receiving enough engagement on your posts.",
                "Labeling someone 'selfish' because they don't share your posts."
            ]
        }
    },
    {
        "Personalization": {
            "Definitions": [
                "Taking responsibility for events outside of your control."
            ],
            "Examples": [
                "Blaming yourself when a post doesn't reach a wide audience, ignoring factors like algorithm changes."
            ]
        }
    }
]